INSERT INTO body_shapes (name, body_fat)
VALUES
    ('Худощавый', 10),
    ('Средний', 20),
    ('Плотный', 30),
    ('Плотный и спортивный', 25);

INSERT INTO emotions (name, danger) VALUES
    ('Радость', 2),
    ('Грусть', 5),
    ('Страх', 8),
    ('Ярость', 10);

INSERT INTO actions (name, difficulty, start_time, end_time) VALUES
    ('Бег', 'легко', '2023-01-01 08:00:00', '2023-01-01 09:00:00'),
    ('Прогулка', 'легко', '2023-01-01 10:00:00', '2023-01-01 11:00:00'),
    ('Чтение', 'легко', '2023-01-01 12:00:00', '2023-01-01 13:00:00'),
    ('Плавание', 'средне', '2023-01-01 14:00:00', '2023-01-01 15:00:00'),
    ('Изучение', 'сложно', '2023-01-01 16:00:00', '2023-01-01 17:00:00'),
    ('Лазание по горам', 'сложно', '2023-01-01 18:00:00', '2023-01-01 19:00:00');

INSERT INTO states (name, intensity, start_time, end_time) VALUES
    ('Активный', 8, '2023-01-01 08:00:00', '2023-01-01 09:00:00'),
    ('Спокойный', 3, '2023-01-01 10:00:00', '2023-01-01 11:00:00'),
    ('Усталый', 6, '2023-01-01 12:00:00', '2023-01-01 13:00:00');

INSERT INTO people (first_name, last_name, father_name, birthday, max_age, action_id, body_shape_id, state_id, gender) VALUES
    ('Иван', 'Иванов', 'Иванович', '1990-01-01', 80, 1, 2, 1, 'Мужчина'),
    ('Мария', 'Петрова', 'Ивановна', '1995-05-15', 75, 2, 1, 2, 'Женщина'),
    ('Петр', 'Сидоров', 'Петрович', '1985-12-10', 90, 3, 3, 3, 'Мужчина'),
    ('Джон', 'Хэммонд', NULL, '1947-01-01', 100, 6, 4, 3, 'Мужчина');

INSERT INTO feelings (owner_id, emotion_id) VALUES
    (1, 1),
    (1, 4),
    (2, 2),
    (3, 3);

INSERT INTO miracles (name, unesco_number, creation_date, loss_date) VALUES
    ('Великая пирамида Гизы', 86, '2500-01-01', NULL),
    ('Статуя свободы', 307, '1886-10-28', NULL);

INSERT INTO creators (creator, miracle) VALUES
    (1, 1),
    (2, 2);
